app/views/developers/index.html.erb

SELECT `developers`.* FROM `developers` WHERE `developers`.`userid` = 1
---
</div>
<%results=Developer.find(:all, :conditions => { :userid=>current_user.id})  %>

SELECT * FROM `lessons` INNER JOIN `developers_lessons` ON `lessons`.id = `developers_lessons`.lesson_id WHERE (`developers_lessons`.developer_id = 1 )
---
<% results.each do |admin| %>
<% admin.lessons.each do |lesson| %>

SELECT `lesson_pages`.* FROM `lesson_pages` WHERE (`lesson_pages`.lesson_id = 1)
---
        <%b=0%>
        <% lesson.lesson_pages.each do |lessonpage| %> &nbsp; &nbsp;