app/views/questionnaires/show.html.erb

SELECT `quests`.* FROM `quests` WHERE (`quests`.questionnaire_id = 1)
---
    <%k=0%>
    <%@questionnaire.quests.each do |question| %>

SELECT `choices`.* FROM `choices` WHERE (`choices`.quest_id = 1)
---
        <%j=0%>
        <% question.choices.each do |choice| %>