app/controllers/choices_controller.rb

  def index
    #@choices = Choice.all
    @choice=Choice.find(:first,:conditions=>{:quest_id=>params[:id]})
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`quest_id` IS NULL LIMIT 1

  def show
    @choice = Choice.find(params[:id])
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 0 LIMIT 1

  def edit
    @choice = Choice.find(params[:id])
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 8 LIMIT 1

  def create
    @choice = Choice.new(params[:choice])

    respond_to do |format|
      if @choice.save
---
INSERT INTO `choices` (`ChoiceAnswers`, `quest_id`, `answer`, `created_at`, `updated_at`) VALUES ('Yes', 2, 1, '2011-08-06 10:02:10', '2011-08-06 10:02:10')