app/controllers/class_details_controller.rb

  def index
    @class_details = ClassDetail.all
---
SELECT `class_details`.* FROM `class_details`

  def create
    @class_detail = ClassDetail.new(params[:class_detail])

    respond_to do |format|
      if @class_detail.save
---
INSERT INTO `class_details` (`classname`, `created_at`, `updated_at`) VALUES ('class 1', '2011-08-06 10:06:10', '2011-08-06 10:06:10')