app/controllers/content_infos_controller.rb

  def index
    @content_infos = ContentInfo.all
---
SELECT `content_infos`.* FROM `content_infos`

  def show
    @content_info = ContentInfo.find(params[:id])
---
SELECT `content_infos`.* FROM `content_infos` WHERE `content_infos`.`id` = 1 LIMIT 1

  def edit
    @content_info = ContentInfo.find(params[:id])
---
SELECT `content_infos`.* FROM `content_infos` WHERE `content_infos`.`id` = 3 LIMIT 1

  def create
   @content_info = ContentInfo.new(params[:content_info])
    respond_to do |format|
      if @content_info.save
---
INSERT INTO `content_infos` (`name`, `path`, `created_at`, `updated_at`) VALUES ('what is ruby?', 'rails.png', '2011-08-06 04:01:50', '2011-08-06 04:01:50')