app/controllers/content_developers_controller.rb

  def index
    if current_user.role.name=='deve'
     redirect_to(:controller => "developers",:action =>"index")
    return
    end
    @content_developers = ContentDeveloper.all
---
SELECT `content_developers`.* FROM `content_developers`