app/controllers/developers_controller.rb

  def index
    @developers = Developer.all
---
SELECT `developers`.* FROM `developers` WHERE (userid != 1)