app/controllers/lesson_pages_controller.rb

  def create
    @lesson_page = LessonPage.new(params[:lesson_page])

    respond_to do |format|
      if @lesson_page.save
---
INSERT INTO `lesson_pages` (`lesson_id`, `content_info_id`, `questionnaire_id`, `created_at`, `updated_at`) VALUES (1, 1, NULL, '2011-08-06 04:02:01', '2011-08-06 04:02:01')