app/controllers/questionnaires_controller.rb

  def index
    @questionnaires = Questionnaire.all
---
SELECT `questionnaires`.* FROM `questionnaires`

  def show
    @questionnaire = Questionnaire.find(params[:id])
---
SELECT `questionnaires`.* FROM `questionnaires` WHERE `questionnaires`.`id` = 1 LIMIT 1

  def edit
    @questionnaire = Questionnaire.find(params[:id])
---
SELECT `questionnaires`.* FROM `questionnaires` WHERE `questionnaires`.`id` = 1 LIMIT 1

  def create
    @questionnaire = Questionnaire.new(params[:questionnaire])
    @quest = Quest.new(params[:quest])
    @choice = Choice.new(params[:choice])

    respond_to do |format|
      if @questionnaire.save
---
INSERT INTO `questionnaires` (`questionnaireName`, `questionID`, `created_at`, `updated_at`) VALUES ('Ruby is OOPs Lanaguage', NULL, '2011-08-06 04:02:37', '2011-08-06 04:02:37')
INSERT INTO `quests` (`question`, `image`, `questionnaire_id`, `created_at`, `updated_at`) VALUES ('helllo who are you?', NULL, 6, '2011-08-08 15:04:06', '2011-08-08 15:04:06')

  def destroy
    @questionnaire = Questionnaire.find(params[:id])

    @answers=Answer.where(:questionnaire_id==@questionnaire)
    @answers.each do |ans|
      ans.destroy
    end

    @lessonpage=LessonPage.where(:questionnaire_id==@questionnaire)
    @lessonpage.each do |lessonpage|
      lessonpage.destroy
    end
    @choice=Choice.find(:all)
    @quest = Quest.find(:all,:conditions=>{:questionnaire_id=>@questionnaire.id})
    @quest.each do |quest |

      @choice.each do |choice |
        if choice.quest_id==quest.id
          choice.destroy
---
SELECT `questionnaires`.* FROM `questionnaires` WHERE `questionnaires`.`id` = 7 LIMIT 1
SELECT `answers`.* FROM `answers`
SELECT `lesson_pages`.* FROM `lesson_pages`
DELETE FROM `lesson_pages` WHERE `lesson_pages`.`id` = 1
DELETE FROM `questionnaires` WHERE `questionnaires`.`id` = 7
DELETE FROM `quests` WHERE `quests`.`id` = 6
SELECT `choices`.* FROM `choices` WHERE (`choices`.quest_id = 6)
SELECT `quests`.* FROM `quests` WHERE `quests`.`questionnaire_id` = 7
SELECT `choices`.* FROM `choices`
DELETE FROM `choices` WHERE `choices`.`id` = 21