app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT `quests`.* FROM `quests`

  def show
    @quest = Quest.find(params[:id])
---
SELECT `quests`.* FROM `quests` WHERE `quests`.`id` = 0 LIMIT 1

  def edit
    @quest = Quest.find(params[:id])
---
SELECT `quests`.* FROM `quests` WHERE `quests`.`id` = 1 LIMIT 1

  def create
    @quest = Quest.new(params[:quest])

    respond_to do |format|
      if @quest.save
---
INSERT INTO `quests` (`question`, `image`, `questionnaire_id`, `created_at`, `updated_at`) VALUES ('What is methods in ruby?', 'rails.png', 1, '2011-08-06 04:02:57', '2011-08-06 04:02:57')

  def update
    params[:quest][:existing_choice_attributes] ||= {}
    @quest = Quest.find(params[:id])

    respond_to do |format|
      if @quest.update_attributes(params[:quest])
---
SELECT `quests`.* FROM `quests` WHERE `quests`.`id` = 10 LIMIT 1
UPDATE `quests` SET `question` = 'hello i am noratbbbhbhb', `updated_at` = '2011-08-08 12:05:20' WHERE `quests`.`id` = 10