app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT `roles`.* FROM `roles`

  def edit
    @role = Role.find(params[:id])
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 6 LIMIT 1

  def create
    @role = Role.new(params[:role])
     respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('teacher', 2, '2011-08-06 04:00:15', '2011-08-06 04:00:15')