app/controllers/student_lesson_page_controller.rb

  def index
  @studentlesson=StudentLesson.where(:user_id=>"#{current_user.id}")
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
SELECT `student_lessons`.* FROM `student_lessons` WHERE `student_lessons`.`user_id` = 4

  def find
    @lessonclass=LessonClass.find(:first,:conditions=>{:unique_classid=>"#{params[:code]}"} )
    if @lessonclass
    #flash[:notice]="Lesson #{@teacherlesson.lesson.lessonName} Added to #{@teacherlesson.user.name}'s list "
    @instructer=User.find(:first,:conditions=>{:id=>"#{@lessonclass.teacherid}"})
---
SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`unique_classid` = 'class 1' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def result
    @studentlesson=StudentLesson.find(:all)
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1

  def add
  @studentlesson=StudentLesson.new
  @studentlesson.user_id=current_user.id
  @studentlesson.lesson_id=params[:lessonid]
  @studentlesson.finished=0
  @lessonclass=LessonClass.find(:first,:conditions=>{:lesson_id=>"#{params[:lessonid]}"} )
 # @class_detail = ClassDetail.find(@class_name)
  @student_detail = StudentDetail.new
  @student_detail.class_detail_id = @lessonclass.class_detail.id
  @student_detail.user_id=current_user.id
  @student_detail.save
  if @studentlesson.save
---
SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 LIMIT 1
INSERT INTO `student_details` (`user_id`, `class_detail_id`, `created_at`, `updated_at`) VALUES (6, 1, '2011-08-09 11:26:48', '2011-08-09 11:26:48')
INSERT INTO `student_lessons` (`lesson_id`, `user_id`, `finished`, `created_at`, `updated_at`) VALUES (1, 6, 0, '2011-08-09 05:41:24', '2011-08-09 05:41:24')

  def lesson
    @answer = Answer.new
    @lessonclass=LessonClass.find(:first,:conditions=>{:lesson_id=>"#{params[:lessonid]}"} )
    @studentlesson=StudentLesson.find(:first,:conditions=>{:lesson_id=>"#{params[:lessonid]}",:user_id=>"#{current_user.id}"} )
    #@j=@studentlesson.finished
    @current=@studentlesson.finished
    @lessonclasslessonid=@lessonclass.lesson_id
    @lesson_name=@lessonclass.lesson.lessonName
    @classname=@lessonclass.class_detail.classname
    @classcode=@lessonclass.unique_classid
    @instructer=User.find(:first,:conditions=>{:id=>"#{@lessonclass.teacherid}"})
    @instructername=@instructer.name
    @lessonpages=LessonPage.find(:all,:conditions=>{:lesson_id=>"#{params[:lessonid]}"})
---
SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 LIMIT 1
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
SELECT `student_lessons`.* FROM `student_lessons` WHERE `student_lessons`.`lesson_id` = 1 AND `student_lessons`.`user_id` = 6 LIMIT 1
SELECT `class_details`.* FROM `class_details` WHERE `class_details`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
SELECT `lesson_pages`.* FROM `lesson_pages` WHERE `lesson_pages`.`lesson_id` = 1

  def teacherlesson
    @current=params[:current]
    @submitbutton=0
    @lessonclass=LessonClass.find(:first,:conditions=>{:lesson_id=>"#{params[:lessonid]}"} )
    @lessonclasslessonid=@lessonclass.lesson_id
    @lesson_name=@lessonclass.lesson.lessonName
    @classname=@lessonclass.class_detail.classname
    @classcode=@lessonclass.unique_classid
    @instructer=User.find(:first,:conditions=>{:id=>"#{@lessonclass.teacherid}"})
    @instructername=@instructer.name
    @lessonpages=LessonPage.find(:all,:conditions=>{:lesson_id=>"#{params[:lessonid]}"})
---
SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 LIMIT 1
SELECT `class_details`.* FROM `class_details` WHERE `class_details`.`id` = 1 LIMIT 1
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `lesson_pages`.* FROM `lesson_pages` WHERE `lesson_pages`.`lesson_id` = 1

  def nextlesson
    @lesson_id=params[:lessonid]
    @count=params[:count]
    @pass=params[:pass]
    #if @pass
    @current=params[:current]
    @val= Integer(@current)
    @val2= Integer(@count)
    @val2=@val2-1
    #@val2=@val2 # to adjust count and array value
    if @val<@val2
      @val=@val+1
    end
    #@j=@val+1
    @current=@val.to_s
    if @pass
    @studentlesson = StudentLesson.find(:first,:conditions=>{:lesson_id=>"#{@lesson_id}",:user_id=>"#{current_user.id}"})
    if @studentlesson
      @studentlesson.finished=@current
      @studentlesson.save
---
SELECT 1 FROM `student_lessons` WHERE `student_lessons`.`lesson_id` = 1 AND (`student_lessons`.`user_id` = 6) AND (`student_lessons`.id <> 1) LIMIT 1
UPDATE `student_lessons` SET `finished` = 1, `updated_at` = '2011-08-09 05:41:31' WHERE `student_lessons`.`id` = 1

   def prevlesson
     @lesson_id=params[:lessonid]
     @pass=params[:pass]
    #if @pass
     @current=params[:current]
     @val= Integer(@current)
    if @val>0
      @val=@val-1
    end
    #@j=@val+1
    @current=@val.to_s
    if @pass
    @studentlesson = StudentLesson.find(:first,:conditions=>{:lesson_id=>"#{@lesson_id}",:user_id=>"#{current_user.id}"})
    if @studentlesson
      @studentlesson.finished=@current
      @studentlesson.save
---
SELECT 1 FROM `student_lessons` WHERE `student_lessons`.`lesson_id` = 1 AND (`student_lessons`.`user_id` = 6) AND (`student_lessons`.id <> 1) LIMIT 1
UPDATE `student_lessons` SET `finished` = 4, `updated_at` = '2011-08-09 05:43:20' WHERE `student_lessons`.`id` = 1

   def answers
        @ans=params[:ans]
        if @ans
              @ans.each do |answer |
                  @answer=Answer.new
                  @answer.choice_id=answer
                  @answer.user_id=current_user.id
                  @answer.questionnaire_id=params[:questionnaire_id]
                  if @answer.save
                    @saved=true
                  else
                   @saved=false
                  end
              end
             questions=[]
             wrongans=[]
             @ans2=@ans
             @correct=0
            @ans.each do | answer|
               pass=0
               passtwo=0
               @choice=Choice.find(:first,:conditions=>{:id=>"#{Integer(answer)}"})
               @questionid=@choice.quest_id
               @choice=Choice.where(:quest_id=>"#{Integer(@questionid)}",:answer=>true)
---
INSERT INTO `answers` (`choice_id`, `user_id`, `questionnaire_id`, `created_at`, `updated_at`) VALUES (20, 6, 5, '2011-08-09 05:42:42', '2011-08-09 05:42:42')
SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 20 LIMIT 1
SELECT `choices`.* FROM `choices` WHERE `choices`.`quest_id` = 5 AND `choices`.`answer` = 1

   def performance
    @correctanwerssize=0
    @lessonclass=LessonClass.find(:first,:conditions=>{:lesson_id=>"#{params[:lessonid]}",:class_detail_id=>"#{params[:classdetailsid]}"} )
    if @lessonclass
    @lessonclasslessonid=@lessonclass.lesson_id
    @lesson_name=@lessonclass.lesson.lessonName
    @classname=@lessonclass.class_detail.classname
    @classcode=@lessonclass.unique_classid
    @instructer=User.find(:first,:conditions=>{:id=>"#{@lessonclass.teacherid}"})
    @instructername=@instructer.name

     @studentdetails=StudentDetail.where(:class_detail_id=>"#{params[:classdetailsid]}")
---
SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 AND `lesson_classes`.`class_detail_id` = 1 LIMIT 1
SELECT `class_details`.* FROM `class_details` WHERE `class_details`.`id` = 1 LIMIT 1
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `student_details`.* FROM `student_details` WHERE `student_details`.`class_detail_id` = '1'