app/controllers/student_details_controller.rb

SELECT `student_details`.* FROM `student_details`
---
  def index
    @student_details = StudentDetail.all

INSERT INTO `student_details` (`user_id`, `class_detail_id`, `created_at`, `updated_at`) VALUES ('2', '1', '2011-08-06 10:06:29', '2011-08-06 10:06:29')
---
  def create
    @student_detail = StudentDetail.new(params[:student_detail])

    respond_to do |format|
      if @student_detail.save