app/controllers/teacher_lesson_details_controller.rb

SELECT `lesson_classes`.* FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 LIMIT 1
SELECT `class_details`.* FROM `class_details` WHERE `class_details`.`id` = 1 LIMIT 1
---
  def index
    @value=params[:id]
    @lessonclass= LessonClass.find(:all,:conditions=>{:lesson_id=>@value})
    @lesson= LessonClass.find(:first,:conditions=>{:lesson_id=>@value})
    @classdetail=ClassDetail.find(:all)

SELECT 1 FROM `lesson_classes` WHERE `lesson_classes`.`lesson_id` = 1 AND (`lesson_classes`.`class_detail_id` = 1) LIMIT 1
SELECT `class_details`.* FROM `class_details` WHERE `class_details`.`id` = 1 LIMIT 1
INSERT INTO `lesson_classes` (`lesson_id`, `class_detail_id`, `unique_classid`, `teacherid`, `created_at`, `updated_at`) VALUES (1, 1, ' -class 1', 2, '2011-08-09 05:37:40', '2011-08-09 05:37:40')
---
  def add
    @lessonclass=LessonClass.new
    #@id=params[:id]
    @id = params[:LessonClass][:class_detail_id]
    @lesson_id=params[:lesson_id]
    @code=params[:code]
    @classname=ClassDetail.find(@id)
    vall="#{@code}-#{@classname.classname}"
    @lessonclass.class_detail_id=@id
    @lessonclass.lesson_id=@lesson_id
    @lessonclass.unique_classid=vall
    @lessonclass.teacherid=params[:teacherid]
    if @lessonclass.save