app/controllers/teacher_details_controller.rb

  def index
    @teacher_details = TeacherDetail.all
---
SELECT `teacher_details`.* FROM `teacher_details`